programming/python/books.org
#+Title: books
#+OPTIONS: ^:nil num:nil author:nil email:nil creator:nil timestamp:nil

- *Automate the Boring Stuff with Python*
  - Al Sweigart
  - 9781593275990
  - 2015
  - xxi, 479 pages
- *Python Crash Course*
  - Eric Matthes
  - 9781593276034
  - 2016
  - xxxii, 525 pages
- *Doing Math with Python*
  - Amit Saha
  - 9781593276409
  - 2015
  - xvii, 244 pages
- *Black Hat Python*
  - Justin Seitz
  - 9781593275907
  - 2015
  - xviii, 170 pages
- *Violent Python*
  - TJ. O'Connor
  - 9781597499576
  - 2013
  - xxv, 262 pages
- *Python Cookbook*
  - David Beazley, Brian Jones
  - 9781449340377
  - Third Edition
  - May 2013
  - xvi, 687 pages
- *Python Essential Reference*
  - David M. Beazley
  - 9780672329784
  - Fourth Edition
  - June 2009
- *Fluent Python*
  - Luciano Ramalho
  - 9781491946008
  - August 2015
  - xxiv, 743 pages

[[file:python.html][back]]
