programming/python/books.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>books</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">books</h1>
<ul class="org-ul">
<li><b>Automate the Boring Stuff with Python</b>
<ul class="org-ul">
<li>Al Sweigart
</li>
<li>9781593275990
</li>
<li>2015
</li>
<li>xxi, 479 pages
</li>
</ul>
</li>
<li><b>Python Crash Course</b>
<ul class="org-ul">
<li>Eric Matthes
</li>
<li>9781593276034
</li>
<li>2016
</li>
<li>xxxii, 525 pages
</li>
</ul>
</li>
<li><b>Doing Math with Python</b>
<ul class="org-ul">
<li>Amit Saha
</li>
<li>9781593276409
</li>
<li>2015
</li>
<li>xvii, 244 pages
</li>
</ul>
</li>
<li><b>Black Hat Python</b>
<ul class="org-ul">
<li>Justin Seitz
</li>
<li>9781593275907
</li>
<li>2015
</li>
<li>xviii, 170 pages
</li>
</ul>
</li>
<li><b>Violent Python</b>
<ul class="org-ul">
<li>TJ. O'Connor
</li>
<li>9781597499576
</li>
<li>2013
</li>
<li>xxv, 262 pages
</li>
</ul>
</li>
<li><b>Python Cookbook</b>
<ul class="org-ul">
<li>David Beazley, Brian Jones
</li>
<li>9781449340377
</li>
<li>Third Edition
</li>
<li>May 2013
</li>
<li>xvi, 687 pages
</li>
</ul>
</li>
<li><b>Python Essential Reference</b>
<ul class="org-ul">
<li>David M. Beazley
</li>
<li>9780672329784
</li>
<li>Fourth Edition
</li>
<li>June 2009
</li>
</ul>
</li>
<li><b>Fluent Python</b>
<ul class="org-ul">
<li>Luciano Ramalho
</li>
<li>9781491946008
</li>
<li>August 2015
</li>
<li>xxiv, 743 pages
</li>
</ul>
</li>
</ul>

<p>
<a href="python.html">back</a>
</p>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
